Ran Plan for 2 projects:

1. dir: `infra/global/iam/roles/crossplane` workspace: `default`
1. dir: `infra/us-east-1/prod/rds/subnet-group` workspace: `default`

### 1. dir: `infra/global/iam/roles/crossplane` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/global/iam/roles/crossplane`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fglobal%252Fiam%252Froles%252Fcrossplane%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/global/iam/roles/crossplane`

---
### 2. dir: `infra/us-east-1/prod/rds/subnet-group` workspace: `default`
<details><summary>Show Output</summary>

```diff
module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.db_subnet_group.aws_db_subnet_group.this[0] must be replaced
-/+ resource "aws_db_subnet_group" "this" {
!       arn                     = "arn:aws:rds:us-east-1:677160962006:subgrp:rds-prod-subnet-group" -> (known after apply)
!       id                      = "rds-prod-subnet-group" -> (known after apply)
!       name                    = "rds-prod-subnet-group" -> "prod-subnet-group" # forces replacement
+       name_prefix             = (known after apply)
!       supported_network_types = [
-           "IPV4",
        ] -> (known after apply)
!       tags                    = {
!           "Name" = "rds-prod-subnet-group" -> "prod-subnet-group"
        }
!       tags_all                = {
!           "Name"         = "rds-prod-subnet-group" -> "prod-subnet-group"
            # (5 unchanged elements hidden)
        }
!       vpc_id                  = "vpc-099d582f5470a11f3" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
!   db_subnet_group_arn                = "arn:aws:rds:us-east-1:677160962006:subgrp:rds-prod-subnet-group" -> (known after apply)
!   db_subnet_group_id                 = "rds-prod-subnet-group" -> (known after apply)
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/prod/rds/subnet-group`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fprod%252Frds%252Fsubnet-group%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/prod/rds/subnet-group`
</details>
Plan: 1 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`